In [9]:
import sqlite3
import pandas as pd
from sqlite3 import connect

In [10]:
### test.sqlite 파일 만들기 (경로지정 + 파일명)
# data path
DB_PATH = '/Users/younjin/Desktop/test.sqlite'

In [7]:
with connect(DB_PATH) as db:
    db.execute("""
    CREATE TABLE IF NOT EXISTS Orders (
        order_id INT,
        item VARCHAR(40),
        amount INT,
        customer_id INT REFERENCES Customers(id),
        CONSTRAINT OrdersPK PRIMARY KEY (order_id)
        )
    """)

In [12]:
with connect(DB_PATH) as db:
    db.execute("""
    CREATE TABLE IF NOT EXISTS Customers (
        id INT,
        last_name VARCHAR(40),
        first_name VARCHAR(40),
        age INT,
        country VARCHAR(10),
        CONSTRAINT CustomersPK PRIMARY KEY (id)

               )
    """)

In [13]:
## 눈으로 확인해봅시다
# 위에서 테이블을 두개 만들었기 때문에 두개
# conn = sqlite3.connect("C:\\Users\\yukir\\Desktop\\강의자료\\sqlite3_실습\\chinook\\test.sqlite")
conn = sqlite3.connect(DB_PATH)
cursor = conn.cursor()
table = pd.read_sql_query("SELECT name FROM sqlite_master WHERE type='table'", conn)
print(table)

        name
0     Orders
1  Customers

In [14]:
##table 형식으로 보기
table = pd.read_sql_query("SELECT * from Orders", conn)
table.head()

Empty DataFrame
Columns: [order_id, item, amount, customer_id]
Index: []

In [15]:
##table 형식으로 보기
table = pd.read_sql_query("SELECT * from Customers", conn)
table.head()

Empty DataFrame
Columns: [id, last_name, first_name, age, country]
Index: []

In [16]:
## insert
# insert sql 작성
INSERT_SQL = 'INSERT INTO Orders(order_id, item, amount, customer_id) VALUES (?,?,?,?);'
## 데이터 여러개 한번에 추가하기
data = (
    (1, '공책', 500,5),
    (2, '펜', 10, 2),
    (3, '마커', 120, 3),
    (4, '책', 1000,1),
    (5, '지우개', 20, 4)
)
# insert로 값 추가

# 여러개 값 추가
cursor.executemany(INSERT_SQL,data)
# 한개의 값만 추가
#cursor.execute(INSERT_SQL, ('KLM444','아이유', 38000))
# 커밋(insertm update delete 는 commit을 꼭 해주어야 데이터베이스에 반영 된다.)
conn.commit()
# 데이터 확인
cursor.execute('SELECT * FROM Orders')
item_list = cursor.fetchall()
for i in item_list:
    print(i)

# 닫기
# conn.close()

(1, '공책', 500, 5)
(2, '펜', 10, 2)
(3, '마커', 120, 3)
(4, '책', 1000, 1)
(5, '지우개', 20, 4)

In [17]:
################################################################
## insert
# insert sql 작성
INSERT_SQL = 'INSERT INTO Customers(id, last_name, first_name, age, country) VALUES (?,?,?,?,?);'
## 데이터 여러개 한번에 추가하기
data = (
    (1,'홍','길동',31,'한국'),
    (2, 'Luna','Robert', 10, '미국'),
    (3, 'Kim','Monica', 35, '러시아'),
    (4, '모리','나나세', 59,'일본'),
    (5, 'Doe','Betty', 20, '영국')
)
# insert로 값 추가

# 여러개 값 추가
cursor.executemany(INSERT_SQL,data)
# 한개의 값만 추가
#cursor.execute(INSERT_SQL, ('KLM444','아이유', 38000))
# 커밋(insertm update delete 는 commit을 꼭 해주어야 데이터베이스에 반영 된다.)
conn.commit()
# 데이터 확인
cursor.execute('SELECT * FROM Customers')
item_list = cursor.fetchall()
for i in item_list:
    print(i)

# 닫기
# conn.close()

(1, '홍', '길동', 31, '한국')
(2, 'Luna', 'Robert', 10, '미국')
(3, 'Kim', 'Monica', 35, '러시아')
(4, '모리', '나나세', 59, '일본')
(5, 'Doe', 'Betty', 20, '영국')

In [18]:
table = pd.read_sql_query("SELECT * from Orders", conn)
table.head()

   order_id item  amount  customer_id
0         1   공책     500            5
1         2    펜      10            2
2         3   마커     120            3
3         4    책    1000            1
4         5  지우개      20            4

In [19]:
table = pd.read_sql_query("SELECT * from Customers", conn)
table.head()

   id last_name first_name  age country
0   1         홍         길동   31      한국
1   2      Luna     Robert   10      미국
2   3       Kim     Monica   35     러시아
3   4        모리        나나세   59      일본
4   5       Doe      Betty   20      영국

In [20]:
## 김모니카의 구매내역을 보기위함

q = """
SELECT * FROM Orders Where customer_id = 3
"""

pd.read_sql_query(q, conn)

   order_id item  amount  customer_id
0         3   마커     120            3

In [21]:
## 김모니카의 정보를 보기위해서

q = """
SELECT * FROM Customers Where id = 3
"""

pd.read_sql_query(q, conn)

   id last_name first_name  age country
0   3       Kim     Monica   35     러시아

In [22]:
import pandas as pd
q = """
SELECT * FROM Customers Where id = 3
"""

pd.read_sql_query(q, conn)

   id last_name first_name  age country
0   3       Kim     Monica   35     러시아

In [23]:
##김 모니타 정보 update

UPDATE_SQL = 'UPDATE Customers set country = "카자흐스탄" WHERE first_name="Monica";'
cursor.execute(UPDATE_SQL)

conn.commit()
# 확인
cursor.execute('SELECT * FROM Customers WHERE first_name="Monica";')
updated_customer = cursor.fetchall()
print(updated_customer)

[(3, 'Kim', 'Monica', 35, '카자흐스탄')]